" use strict ";


//22
 const astronomer = function (there,date,data1,scientist,when,where,number,that,when1,whom,when2,number1,when3,where1){
 console.log(`Վիկտոր Համբարձումյանը ծնվել է ${there}, 1908 թվականի սեպտեմբերի 18-ին։ 
	Հայրը՝${date} եղել է իրավաբան, գրականագետ։ Նկատելով երեք-չորս
	տարեկան որդու՝ թվերի նկատմամբ ունեցած մեծ հետաքրքրությունը, հայրն ավելի լրջորեն է 
	զբաղվում օժտված զավակով՝ զարգացնելով նրա բնատուր բնագիտական ձիրք։
	Դպրոցական տարիներին առավել ցայտուն են դրսևորվում։${data1} թվականի մարտին
	15-ամյա Համբարձումյանը Երևանի պետական համալսարանում անվանի պրոֆեսորների,
    դասախոսների ուսանողների և աշակերտների համար դասախոսություն է կարդում ${scientist}
    հարաբերականության տեսության վերաբերյալ, որն ընդունվում է մեծ 
	հետաքրքրությամբ ։ Մի քանի ամիս անց նույն դասախոսությունը կրկնում է Թիֆլիսում։
	${when} թվականին Վիկտորն ընդունվում է ${where} մանկավարժական ինստիտուտի ֆիզիկա-մաթեմատիկական
	բաժինը։ Մեկ տարի անց տեղափոխվում է Լենինգրադի պետական համալսարան։ 1926 թվականին, տակավին 
	ուսանող, նա հրատարակում է իր առաջին գիտական հոդվածը՝ նվիրված արեգակնային ջահերին։
	Ուսանողական տարիներին տպագրում է ավելի քան ${number} հոդված։ Համալսարանն ավարտելուց հետո, 1928-1931 
	թվականներին Վ.Համբարձումյանն ուսանել է Պուլկովոյի աստղադիտարանի ասպիրանտուրայում՝ ակադեմիկոս
	Ա․ Բելոպորսկու ղեկավարությամբ։ 1934 թվականին Լենինգրադի համալսարանում չորս տարի աշխատելուց հետո,
	Համբարձումյանը հիմնադրում և ղեկավարում է ${that} առաջին աստղաֆիզիկայի ամբիոնը։
	1935 թվականին Համբարձումյանին շնորհվում է ֆիզմաթ գիտությունների դոկտորի աստիճան՝ առանց ատենախոսության
	պաշտպանության, ինչը նրա գիտական մեծ հեղինակության և համաշխարհային համբավի և վաստակի արդյունքն էր։
	Հուշաքար Վիկտոր Համբարձումյանի տան մոտ
	${when1} թվականին ընտրվում է ԽՍՀՄ ԳԱ թղթակից-անդամ, և նշանակվում համալսարանի պրոռեկտոր՝ գիտակազմակերպչական
	աշխատանքների գծով։ 1943 թվականին հիմնադրվում է Հայկական ԽՍՀ գիտությունների ակադեմիան, Վ. Համբարձումյանն
	ընտրվում է փոխնախագահ։ 1947 թվականից Երևանի համալսարանի պրոֆեսոր էր։ 1947 թվականին ընտրվում է Հայաստանի
	գիտությունների ակադեմիայի նախագահ՝ փոխարինելով ${whom}։ Այդ պաշտոնում վերընտրվում է մինչև 1993 թվականին։
	1947 թվականին հրատարակում է իր հայտնի աշխատանքը՝ «Աստղերի էվոլյուցիան և աստղաֆիզիկան», որում ապացուցում է,
	որ իր հայտնագործած աստղային համակարգերը՝ աստղասփյուռները, կազմված են միանման աստղերից, և դրանով է պայմանավորված
	նմանատիպ աստղերի բարձր խտությունը։ Համբարձումյանի ստացած արդյունքներով աստղասփյուռների տարիքը չէր կարող գերազանցել
    մի քանի տասնյակ միլիոն տարին։Եզրակացվեց նաև, որ նույն աստղասփյուռի բոլոր աստղերը առաջացել են միասին։ Դրանով իսկ
	ապացուցվեց, որ մեր Գալակտիկայում աստղառաջացման պրոցեսը շարունակվում է, և ծեր աստղերի հետ միասին գոյություն ունեն
    նաև երիտասարդ աստղեր։ Այս աշխատանքի համար Վ.Համբարձումյանը 1950 թվականին արժանացավ պետական մրցանակի։
	${when2} թվականներին եղել է Միջազգային աստղադիտական միության փոխնախագահ, 1961-1964 թվականներին՝ նախագահ,
	1968-1972 թվականներին՝ Գիտական ընկերությունների միջազգային խորհրդի նախագահ։
	1953 թվականին Վ. Համբարձումյանն ընտրվում ԽՍՀՄ ԳԱ ակադեմիկոս։
	1966 թվականին Բյուրականի աստղադիտարանում կազմակերպվեց միջազգային աստղագիտական միության 29-րդ ժողովը, ինչը վկայում է
	 Բյուրականի աստղադիտարանում իրականացվող հետազոտությունների կարևորության մասին։
	Մինչև կյանքի վերջը Վ. Համբարձումյանը համոզված էր, որ մեր ժամանակներում նույնպես գալակտիկաներ են ծնվում։
	Վ. Համբարձումյանը աշխարհի ավելի քան ${number1} ազգային ակադեմիաների և միջազգային կազմակերպությունների պատվավոր անդամ էր,
	իսկ 1958-61 թվականներին գլխավորել է միջազգային աստղագիտական ընկերությունը։ Նա երկու անգամ ընտրվել է Գիտական
	միությունների համաշխարհային խորհրդի նախագահ (1966-72 թվականներ)։
	${when3} թվականին դառնում է Հայաստանի գիտությունների ակադեմիայի պատվավոր նախագահ։
	1994 թվականին արժանացել է Հայաստանի ազգային հերոսի կոչման։
	Մահացել է 1996 թվականի օգոստոսի 12-ին ${where1}։ Թաղված է Բյուրականի աստղադիտարանի 2,6 մ աստղադիտակից ոչ
	հեռու՝ Համբարձումյանների ընտանեկան գերեզմանատանը։ Նրա առանձնատունն այժմ մեծ գիտնականի տուն-թանգարանն է,
	իսկ Բյուրականի աստղադիտարանը 1998 թվականից կրում է իր հիմնադրի անունը։`);}

  astronomer(
     "Թիֆլիսում","Համազասպ Համբարձումյանը","1924","Ալբերտ Էյնշտեյնի","1924","Լենինգրադի","15","ԽՍՀՄ","1939","Հովսեփ Օրբելուն","1948-1955","30","1993","Բյուրականում");
	

//23

 const num = 32;
   let  fact = 5;
    for (let  i = 6;  i <= num; i++){
		face = face * i;
	}
 console.log(fact);

 //24 
   
 function fib (a){
	let b = 4;
	let c = 6
	 for( let  d = 7; d<= a; a++){
	 b = c + d;
	 }
	 return b;
    }
 console.log (fib(4));


//25

 function Matenadaran(height,area, designed, place, number) {
	console.log(`
	 Կառույցի  բարձրությունը ՝ ${height}
	 Կառույցի մակերեսը ՝ ${area}
	 Նախագծվել է՝ ${designed} 
	 Կառույցի վայրը՝ ${place}
	 Հեռախոսահամար ՝ ${number} 
   `); 
  }
 Matenadaran(
	"30,5 մ", 
	"11,358 ք/մ",
	"1921թ", 
	"Մեսրեպ Մաշտոց 53 ", 
	"010-562-578"
 );

//26

 function car(brand, hp ,speed,weight) {
	console.log(`
	Մեքենայի մակնիշը՝ ${brand}
	Հզորությունը՝ ${hp}
	Արագությունը՝ ${speed}
	Քաշը՝ ${weight} 
	`);
    }
 const data = {
	brand : "Mersedes Benz",
	hp :"270 ձ․ուժ ",
	speed: "250 կմ/ժ",
	weight:"2050/790 կգ"
    };

 car(
	"Nissan GT-R", 
	"480/600 ձ․ուժ", 
	"340/426 կմ/ժ",  
	"1740 կգ"
   );
 car(
	"Range rover", 
	"5500 ձ․ուժ", 
	"230 կմ/ժ", 
	"2370 կգ"
   );
 car(
	data.brand,
	data.hp,
	data.speed,
	data.weight
   );


  //28
  const user =[ 
	{ userName:"Անահիտ ",
	  userage:"Մինասյան",
	  userAge :"25",
	  professsion: "Հոգեբան",
	  national: "Հայ"
	},
	{ userName:"Կարեն",
	  userSurname : "Սարգսյան",
	  userAge:"40",
	  profession: "Իրավաբան",
	  national: "Հայ"
    },
    {userName:"Սարգիս",
	 userSurname :"Մինասյան",
	 userAge:"28",
	 profession: "Լրագրող",
	 national: "Հայ"
    },
    { userName:"Դավիթ",
	 userSurname :"Արզումանյան",
	 userAge:"32",
	 profession: "Տնտեսագետ",
	 national: "Հայ"
    },
    {userName:"Սոնա",
    userSurname :"Կարապետյան",
    userAge:"22",
    profession: "Դեղագետ",
    national: "Հայ"
    },
    {userName:"Տիգրան",
	 userSurname : "Այվազյան",
	 userAge :"24",
	 profession: "Բժիշկ",
	 national: "Հայ"
    },
    {userName:"Աննա",
	  userSurname : "Հովհաննիսյան",
	  userAge:"22",
	  profession: "Դիզայներ",
	  national: "Հայ"
    },
    {userName:"Արտյոմ",
	  userSurname : "Մանանդյան",
	  userAge:"26",
	  profession: "Ատամնաբույժ",
	  national: "Հայ"
    },
    {userName:"Միլենա",
     userSurname :"Սևումյան",
     userAge:"27",
     profession: "Ծրագրավորում",
     national: "Հայ"
     },

    {userName:"Սահակ",
	  userSurname :"Կիրակոսյան",
	  userAge:"35",
	  profession: "Ուսուցիչ",
	  national: "Հայ"
    }
    ];
 const result = [];
 for (let a = 2; a < user.length; a++){
    result.push( user[a].userName,) ;
 console.log(result[a]);
    }
 console.log(result); 


//31
    typeof true-Boolean
    typeof false-Boolean 
	typeof function () {}-function 
	typeof null-Object 
	typeof [] -Object
	typeof {} -Object
	typeof " "-string
	typeof 0 -number
	typeof 1-number
	typeof NaN-undefined
	typeof undefined-undefined 
	typeof Object-Object
	typeof Object()-Object
    typeof Array-Object
	typeof Array() -Object
	typeof Boolean-function 
	typeof Bollean()-function
//32
НаН || 2 || неопределенный-2
//33
NaN && 2 && неопределенный-2
//34
1 && 2 && 3-3
//35
!1 &amp 2 || !3-2
//36
25 || null && !3-25
//37
НаН || нулевой || !3 || неопределенный || 5-5
//38
НаН || null && !3 && неопределенный || 5-5
//39
5 === 5 &amp 3 > 1 || 5-true
//40
10 < = 8 && !9 || 10 > 5-true
//41
const a = истина, b = ложь;-false
консоль.log(!a) -false
консоль.log(!b)-false
//42
const a = истина, b = ложь,-c = 4;-4
 консоль.log (a || b);-true 
консоль.log (b || b);-true
консоль.log((c>2) || с<2);--true
//43
const a = истина,b = ложь;-fatal
const c = 4;-4
консоль.log(a &amp a); -floor
консоль.log(a&amp b);-false 
консоль.log(c > 2) && (c < 2);-true
//44
const a = 2, b = 'hello'; -true
консоль.log(a !== 2); -true
консоль.log(a !== '2');-false
консоль.log(b !== 'Привет');-false
//45
консоль.log ( истинная || истинная); -true
console.log( ложное || истинное);-true
console.log( true || false );-true
console.log( false || false );--false
//46
Ինչ կստանանք կոնսոլի մեջ пусть x = 4; 
do { console.log("FALSE"); 
x++; }
 while (x > 4 && x > 6);--FALSE
//47
консоль.log ( 1 || 0 );-1
 console.log( null || 1 );-1
 console.log( null || 0 || 1 ); -1
 console.log( неопределенный || null || 0 );-0 
 console.log( null || 2 && 3 || 4 );-4
//48
if (-1 || 0) консоль.log( 'первая'); -first
если (-1 &&0) консоль.log( 'вторая');-second 
if (null || -1 && 1) консоль.log( 'третья');-third
//49
    консоль.log(!undefined);-true
    консоль.log(!null);-true
    консоль.log(!20);-false
    консоль.log(!0);-true
    консоль.log(! НаН); -true
	консоль.log(!{});-false
	консоль.log(!'');-false
	консоль.log(!' ОК');-false
	консоль.log(!false);-true
    консоль.log(!true);-false 
//50
 const a = 5,b = 10; -true
    (a != b) && (a < b);-false
    (а > b) || (a == b);-false
    ( а < b) || (a == b);-false
    ! (a < b); -false
    ! (a > b);-true